tuna-f1sh/wooden-bits/bClock/hardware/wooden-bits/avr/boards.txt
##############################################################

woodenbits.name=Wooden Bits (8 MHz internal clock)

woodenbits.upload.protocol=arduino
woodenbits.upload.maximum_size=30720
woodenbits.upload.speed=57600

woodenbits.bootloader.low_fuses=0xE2
woodenbits.bootloader.high_fuses=0xDA
woodenbits.bootloader.extended_fuses=0x05

woodenbits.bootloader.file=atmega/ATmegaBOOT_168_atmega328_pro_8MHz.hex
woodenbits.bootloader.unlock_bits=0x3F
woodenbits.bootloader.lock_bits=0x0F

woodenbits.build.mcu=atmega328p
woodenbits.build.f_cpu=8000000L
woodenbits.build.core=arduino:arduino
woodenbits.build.variant=arduino:standard

woodenbits.bootloader.tool=arduino:avrdude
woodenbits.upload.tool=arduino:avrdude
